test/nexj/core/persistence/sql/data/readAggregate.xml

<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[5]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
            <Item href="#e"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[10]">
            <Item>lastName</Item>
            <Item>_uniqueCountryCnt</Item>
            <Item>_max</Item>
            <Item>_sum</Item>
            <Item>_countryCnt</Item>
            <Item>_avg</Item>
            <Item>_min</Item>
            <Item>_nullCodeCnt</Item>
            <Item>firstName</Item>
            <Item>addressCount</Item>
         </keys>
         <values nc:arrayType="xs:anyType[10]">
            <Item xi:type="xs:string">Test</Item>
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Toronto</Item>
            <Item xi:type="xs:int">20</Item>
            <Item xi:type="xs:long">2</Item>
            <Item xi:type="xs:decimal">1E+1</Item>
            <Item xi:type="xs:int">7</Item>
            <Item xi:type="xs:long">0</Item>
            <Item xi:type="xs:string">Joe</Item>
            <Item xi:type="xs:int">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[10]">
            <Item>lastName</Item>
            <Item>_uniqueCountryCnt</Item>
            <Item>_max</Item>
            <Item>_sum</Item>
            <Item>_countryCnt</Item>
            <Item>_avg</Item>
            <Item>_min</Item>
            <Item>_nullCodeCnt</Item>
            <Item>firstName</Item>
            <Item>addressCount</Item>
         </keys>
         <values nc:arrayType="xs:anyType[10]">
            <Item xi:type="xs:string">Test</Item>
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Richmond Hill</Item>
            <Item xi:type="xs:int">13</Item>
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:decimal">13</Item>
            <Item xi:type="xs:int">13</Item>
            <Item xi:type="xs:long">0</Item>
            <Item xi:type="xs:string">Zoe</Item>
            <Item xi:type="xs:int">1</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAw==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[10]">
            <Item>lastName</Item>
            <Item>_uniqueCountryCnt</Item>
            <Item>_max</Item>
            <Item>_sum</Item>
            <Item>_countryCnt</Item>
            <Item>_avg</Item>
            <Item>_min</Item>
            <Item>_nullCodeCnt</Item>
            <Item>firstName</Item>
            <Item>addressCount</Item>
         </keys>
         <values nc:arrayType="xs:anyType[10]">
            <Item xi:type="xs:string">Smith</Item>
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Wakefield</Item>
            <Item xi:type="xs:int">16</Item>
            <Item xi:type="xs:long">2</Item>
            <Item xi:type="xs:decimal">8</Item>
            <Item xi:type="xs:int">7</Item>
            <Item xi:type="xs:long">0</Item>
            <Item xi:type="xs:string">John</Item>
            <Item xi:type="xs:int">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABA==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[10]">
            <Item>lastName</Item>
            <Item>_uniqueCountryCnt</Item>
            <Item>_max</Item>
            <Item>_sum</Item>
            <Item>_countryCnt</Item>
            <Item>_avg</Item>
            <Item>_min</Item>
            <Item>_nullCodeCnt</Item>
            <Item>firstName</Item>
            <Item>addressCount</Item>
         </keys>
         <values nc:arrayType="xs:anyType[10]">
            <Item xi:type="xs:string">Julius</Item>
            <Item xi:type="xs:long">1</Item>
            <Item xi:type="xs:string">Roma</Item>
            <Item xi:type="xs:int">11</Item>
            <Item xi:type="xs:long">2</Item>
            <Item xi:type="xs:decimal">5.5</Item>
            <Item xi:type="xs:int">4</Item>
            <Item xi:type="xs:long">0</Item>
            <Item xi:type="xs:string">Gaius</Item>
            <Item xi:type="xs:int">2</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="e">
         <class>Contact</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[10]">
            <Item>lastName</Item>
            <Item>_uniqueCountryCnt</Item>
            <Item>_max</Item>
            <Item>_sum</Item>
            <Item>_countryCnt</Item>
            <Item>_avg</Item>
            <Item>_min</Item>
            <Item>_nullCodeCnt</Item>
            <Item>firstName</Item>
            <Item>addressCount</Item>
         </keys>
         <values nc:arrayType="xs:anyType[10]">
            <Item xi:nil="true"/>
            <Item xi:type="xs:long">0</Item>
            <Item xi:nil="true"/>
            <Item xi:nil="true"/>
            <Item xi:type="xs:long">0</Item>
            <Item xi:nil="true"/>
            <Item xi:nil="true"/>
            <Item xi:type="xs:long">0</Item>
            <Item xi:type="xs:string">Gnaeus</Item>
            <Item xi:type="xs:int">0</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
